[
    {
        "id": "01",
        "catagoryId": "01",
        "name": "Ultimate Web Designer & Web Developer Course",
        "description": "Brad Hussey is updating the entire course to be even more relevant to the modern web designer and front-end web developer as we enter into 2022. Join now to get access! This course by Brad Hussey is the go-to, most comprehensive, A to Z web design, web development and career-building course that will kickstart your progress by focusing on what you need to learn, and avoiding the unnecessary details. Are you a total beginner looking for an all-in-one Web Design, Web Development and Career Building course that takes you step-by-step through all of the necessary skills you need to know to start working professionally as a web designer or developer?",
        "thumbnail": "https://media.geeksforgeeks.org/wp-content/cdn-uploads/20200203200336/13-Things-You-Should-Know-Before-You-Enter-In-Web-Development.png",
        "price": "29.99",
        "students": "464641",
        "rating": "4.5",
        "author": "Brad Hussey"
    },
    {
        "id": "02",
        "catagoryId": "01",
        "name": "Learn JavaScript for Web Development",
        "description": "This course will teach you the most popular programming language in the world. Which is JavaScript! Yes, the JavaScript! If you are interested in building dynamic & interactive projects in web development then this is the right course for you. This course will start teaching you the very basics of JavaScript language and will gradually take you to the advanced level. You will learn a deep understanding of JavaScript concepts. You will see the beauty and power of JavaScript language and you would be able to apply all these skills in modern web development. Along the way, you will have quizzes, coding assignments to polish your JavaScript programming skills. You will learn JavaScript coding standards with best practices. After learning all the essentials of JavaScript language then you will build an interactive web project. And you will see, how with very basic HTML, CSS, and JavaScript essentials you can build modern-looking web projects.  ",
        "thumbnail": "https://cdn.geekboots.com/geek/javascript-meta-1652702081069.jpg",
        "price": "77.99",
        "students": "46467",
        "rating": "4.3",
        "author": "Irfan Dayan"
    },
    {
        "id": "03",
        "catagoryId": "01",
        "name": "Front End Web Development Ultimate Guide 2022",
        "description": "Hi and Welcome to Front End Web Development Ultimate Course 2022 I'm you instructor Josh Werner and I'll be leading you through this course Have you always wanted to learn how to code but don't know where to start? Would you like to make amazing websites and bring your ideas to life? Then Front End Web Development Ultimate Course 2022 is for you! Programming is the most in-demand skill in 2022. The course begins with the basics. I'll take you through everything you need to know to start building websites like an expert. We'll Cover HTML5, CSS3, JavaScript, jQuery, Bootstrap 4 and SVG from scratch. You'll learn all the fundamentals of Front-End Web Development and how you canUse them to start creating you own websites. The course is packed with over 98 hours of hands-on tutorials",
        "thumbnail": "https://res.cloudinary.com/practicaldev/image/fetch/s--mgVodcWf--/c_imagga_scale,f_auto,fl_progressive,h_900,q_auto,w_1600/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/pp4ll13f5onw4gqj8ggl.jpg",
        "price": "244.99",
        "students": "61654",
        "rating": "4.6",
        "author": "Learn Tech Plus"
    },
    {
        "id": "04",
        "catagoryId": "01",
        "name": "Node.js, Express, MongoDB & More: The Complete Bootcamp 2022",
        "description": "Do you want to build fast and powerful back-end applications with JavaScript? Would you like to become a more complete and in-demand developer? Then Node.js is the hot technology for you to learn right now, and you came to the right place to do it! Welcome to the Complete Node.js, Express, and MongoDB Bootcamp, your fast track to modern back-end development.This course is the perfect all-in-one package that will take you from a complete beginner to an advanced, highly-skilled Node.js developer.Like all my other courses, this one is completely project-based! And not just any project: it's a complete, beautiful, and feature-rich application, containing both a RESTful API and a server-side rendered website. It's the most fantastic and complete project that you will find in any Node.js course on the internet!By building this huge project, you will learn all the skills that you need in order to plan, build, and deploy your own modern back-end applications with Node.js and related technologies.",
        "thumbnail": "https://miro.medium.com/max/600/0*11eDqY4zA04y2_n6.jpg",
        "price": "69.99",
        "students": "84507",
        "rating": "4.7",
        "author": "Jonas Schmedtmann"
    },
    {
        "id": "05",
        "catagoryId": "01",
        "name": "MERN Stack Front To Back: Full Stack React, Redux & Node.js",
        "description": "Welcome to MERN Stack Front To Back. In this course we will build an in depth full stack social network application using Node.js, Express, React, Redux and MongoDB along with ES6+. We will start with a blank text editor and end with a deployed full stack application. This course includes...Building an extensive backend API with Node.js & Express Protecting routes/endpoints with JWT (JSON Web Tokens) Extensive API testing with Postman Integrating React with our backend in an elegant way, creating a great workflow Building our frontend to work with the API Using Redux for app state management Creating reducers and actions for our resources Creating many container components that integrate with Redux Testing with the Redux Chrome extension Creating a build script, securing our keys and deploy to Heroku using Git",
        "thumbnail": "https://miro.medium.com/max/680/1*OUCRCkZjJ_85PFH2FZt3lg.jpeg",
        "price": "84.99",
        "students": "59256",
        "rating": "4.5",
        "author": "Brad Traversy"
    },
    {
        "id": "06",
        "catagoryId": "02",
        "name": "2022 Complete Python Bootcamp From Zero to Hero in Python",
        "description": "Become a Python Programmer and learn one of employer's most requested skills of 2022! This is the most comprehensive, yet straight-forward, course for the Python programming language on Udemy! Whether you have never programmed before, already know basic syntax, or want to learn about the advanced features of Python, this course is for you! In this course we will teach you Python 3. With over 100 lectures and more than 21 hours of video this comprehensive course leaves no stone unturned! This course includes quizzes, tests, coding exercises and homework assignments as well as 3 major projects to create a Python project portfolio! Learn how to use Python for real-world tasks, such as working with PDF Files, sending emails, reading Excel files, Scraping websites for informations, working with image files, and much more!",
        "thumbnail": "https://contentstatic.techgig.com/thumb/msid-79386213,width-460,resizemode-4/5-Myths-around-Python-programming-language-that-every-programmer-must-know.jpg?88712",
        "price": "29.99",
        "students": "166845",
        "rating": "4.6",
        "author": "Jose Portilla"
    },
    {
        "id": "07",
        "catagoryId": "02",
        "name": "Python for Data Science and Machine Learning Bootcamp",
        "description": "Are you ready to start your path to becoming a Data Scientist! This comprehensive course will be your guide to learning how to use the power of Python to analyze data, create beautiful visualizations, and use powerful machine learning algorithms! Data Scientist has been ranked the number one job on Glassdoor and the average salary of a data scientist is over $120,000 in the United States according to Indeed! Data Science is a rewarding career that allows you to solve some of the world's most interesting problems! This course is designed for both beginners with some programming experience or experienced developers looking to make the jump to Data Science!",
        "thumbnail": "https://www.superheuristics.com/wp-content/uploads/2020/05/DataCamp-Data-Scientist-with-Python-1.jpg",
        "price": "119.99",
        "students": "585512",
        "rating": "4.6",
        "author": "Josh Portilla"
    },
    {
        "id": "08",
        "catagoryId": "02",
        "name": "Artificial Intelligence A-Z™: Learn How To Build An AI",
        "description": "1. Complete beginner to expert AI skills – Learn to code self-improving AI for a range of purposes. In fact, we code together with you. Every tutorial starts with a blank page and we write up the code from scratch. This way you can follow along and understand exactly how the code comes together and what each line means. 2. Code templates – Plus, you’ll get downloadable Python code templates for every AI you build in the course. This makes building truly unique AI as simple as changing a few lines of code. If you unleash your imagination, the potential is unlimited. 3. Intuition Tutorials – Where most courses simply bombard you with dense theory and set you on your way, we believe in developing a deep understanding for not only what you’re doing, but why you’re doing it. That’s why we don’t throw complex mathematics at you, but focus on building up your intuition in coding AI making for infinitely better results down the line. 4. Real-world solutions – You’ll achieve your goal in not only 1 game but in 3. Each module is comprised of varying structures and difficulties, meaning you’ll be skilled enough to build AI adaptable to any environment in real life, rather than just passing a glorified memory “test and forget” like most other courses. Practice truly does make perfect.",
        "thumbnail": "https://pythongeeks.org/wp-content/uploads/2022/03/what-is-artificial-intelligence.webp",
        "price": "84.99",
        "students": "186719",
        "rating": "4.4",
        "author": "Hadelin de Ponteves"
    },
    {
        "id": "09",
        "catagoryId": "02",
        "name": "Build a Backend REST API with Python & Django - Beginner",
        "description": "Welcome to the beginner course on How to Build a REST API from scratch, using Django, Django REST Framework, Python, Vagrant, VirtualBox, Atom, and ModHeaders. You'll also learn how to deploy your dev server to AWS! This course is made with Django 2.2 and Django REST Framework 3.9. The skills taught in this course are absolutely essential for creating successful products that users love and can’t live without. Facebook, Instagram, Snapchat, you name it. These apps all have their own backend REST APIs that handle millions of call requests everyday. You cannot build a successful app without a backend REST API. Not only is it essential to whatever app or MVP you are building -- the skills you learn in this course will make you a kickass developer in the workplace. If you’re a front-end developer and you take this course, you’ll be able to “speak backend” with your colleagues and understand what’s going on “under the hood” of all your projects, increasing your confidence and earning the respect of your peers.",
        "thumbnail": "https://frontegg.com/wp-content/uploads/2022/06/Django-Agile-1.png",
        "price": "25.99",
        "students": "25,418",
        "rating": "4.4",
        "author": "Mark Winterbottom"
    },
    {
        "id": "10",
        "catagoryId": "03",
        "name": "Java Programming Masterclass covering Java 11 & Java 17",
        "description": "You’ve just stumbled upon the most complete, in-depth Java programming course online. With close to 600,000 students enrolled and over one hundred and forty thousand reviews (with tens of thousands of those 5-star) to date, these comprehensive java tutorials cover everything you’ll ever need. Are you aiming to get your first Java Programming job but struggling to find out what skills employers want and which course will give you those skills? This course is designed to give you the Java skills you need to get a job as a Java developer.  By the end of the course, you will understand Java extremely well and be able to build your own Java apps and be productive as a software developer. Lots of students have been successful in getting their first job or promotion after going through the course.",
        "thumbnail": "https://www.vinsys.com/blog/wp-content/uploads/2022/01/Java-Programming-Training-For-Beginners.jpg",
        "price": "49.99",
        "students": "724905",
        "rating": "4.5",
        "author": "Tim Buchalka"
    },
    {
        "id": "11",
        "catagoryId": "03",
        "name": "Android Java Masterclass - Become an App Developer",
        "description": "There’s no getting around it. Android accounts for 81.7% of all smartphones sold, but not all come packed with the very latest Android Nougat. That won’t worry you because after completing this course, the apps you build will perform brilliantly on Android Nougat or any older Android operating system. Now that’s something most courses don’t teach you! So, you want to be an Android 7 Nougat programmer?  Or you are interested in Android 8 Oreo? Well, I’m Tim Buchalka, one of your instructors, and I’ve designed the Android 7 Nougat App and Android 8 Orea Masterclass just for you!  Yes one, course covering both version!",
        "thumbnail": "https://miro.medium.com/max/1400/1*CDCeyYxNhl-VTM0-MtmC-Q.png",
        "price": "99.99",
        "students": "67670",
        "rating": "4.5",
        "author": "Tim Buchalka"
    },
    {
        "id": "12",
        "catagoryId": "03",
        "name": "Spring & Hibernate for Beginners (includes Spring Boot)",
        "description": "his course covers the LATEST VERSIONS of Spring 5 and Hibernate 5! The course also includes Spring Boot and Spring Data JPA Build a complete Spring MVC + Hibernate CRUD web app ... all from scratch! (real-time project) You will learn about: Spring Core, AOP, Spring MVC, Spring Security, Spring REST, Spring Boot, Spring Data JPA, Spring Data REST, Thymeleaf and Hibernate ... all connected to a MySQL database By the end of this course, you will create all of the source code for a complete Spring MVC - Hibernate CRUD real-time project. You will also develop Spring REST APIs for a full CRUD REST API real-time project. You will type in every line of code with me in the videos ... all from scratch. I explain every line of code that we create. So this isn't a copy/paste exercise, you will have a full understanding of the code. ",
        "thumbnail": "https://miro.medium.com/max/750/1*iIBUBSwj4ZEffM_gdg9Hug.jpeg",
        "price": "84.99",
        "students": "280593",
        "rating": "4.6",
        "author": "Chad Darby"
    },
    {
        "id": "13",
        "catagoryId": "04",
        "name": "The Complete Cyber Security Course : Network Security!",
        "description": "Become a cyber security specialist. After this course, you will be able to discover security vulnerabilities across an entire network, by using network hacking techniques and vulnerability scanning. You will be able to architect your network for maximum security and prevent local and remote attacks. We also cover the use of custom router firmware to provide you with better network security services. You will understand the various types of firewalls that are available and what threats each help mitigate. Including layer 4 firewalls like Iptables on Linux and PF on MacOS and BSD. Virtual firewalls, host-based firewalls and application based firewalls like Pfsence. We cover firewalls on all platforms including Windows, Mac OS X and Linux for all types of use scenarios.",
        "thumbnail": "https://cdn-res.keymedia.com/cms/images/us/036/0248_637317913147707069.jpg",
        "price": "119.99",
        "students": "40819",
        "rating": "4.8",
        "author": "Nathan House"
    },
    {
        "id": "14",
        "catagoryId": "04",
        "name": "Learn Ethical Hacking From Scratch",
        "description": "Welcome this comprehensive Ethical Hacking course! This course assumes you have NO prior knowledge and by the end of it you'll be able to hack systems like black-hat hackers and secure them like security experts! This course is highly practical but it won't neglect the theory; we'll start with ethical hacking basics, breakdown the different penetration testing fields and install the needed software (on Windows, Linux and Mac OS X), then we'll dive and start hacking straight away. You'll learn everything by example, by analysing and exploiting different systems such as networks, servers, clients, websites .....etc. We'll never have any boring dry theoretical lectures.",
        "thumbnail": "https://www.invensislearning.com/blog/wp-content/uploads/2020/11/Top-Ethical-Hacking-Tools-of-2020-1068x552-1.jpg",
        "price": "99.99",
        "students": "525681",
        "rating": "4.6",
        "author": "z Security"
    },
    {
        "id": "15",
        "catagoryId": "04",
        "name": "Learn Social Engineering From Scratch",
        "description": "Welcome to this comprehensive course on Social Engineering! In this course, you will start as a beginner with no previous knowledge in hacking, and by the end of it you'll be at a high level in social engineering being able hack into all major operating systems (windows, OS X, Linux and Android) like black-hat hackers and secure yourself from hackers. This course is focused on the practical side of social engineering without neglecting the theory, first you'll learn how to install the needed software (on Windows, Linux and Mac OS X), then the course is divided into a number of sections to represent the steps you'd take to successfully hack a target using social engineering.",
        "thumbnail": "https://www.hornetsecurity.com/wp-content/uploads/2019/07/social-engineering.jpg",
        "price": "59.99",
        "students": "39645",
        "rating": "4.7",
        "author": "Zaid Sabih"
    },
    {
        "id": "16",
        "catagoryId": "04",
        "name": "Kali Linux Tutorial For Beginners",
        "description": "You want to learn hacking with Kali Linux but you do not know where to start? Do you find the command line confusing and intimidating? If yes, this is the perfect course for you. In this Kali Linux tutorial, we start you off with the assumption that you know absolutely nothing about Linux! Starting from scratch you will build up your knowledge on how to use Kali Linux and before you know it you will become fluent with the basic tools and commands not just in Kali, but in most Linux systems.",
        "thumbnail": "https://res.cloudinary.com/practicaldev/image/fetch/s--xIh62QvK--/c_imagga_scale,f_auto,fl_progressive,h_900,q_auto,w_1600/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/tps8yqrc42qayb4gmfyd.png",
        "price": "99.99",
        "students": "68249",
        "rating": "4.6",
        "author": "Hackers Academy"
    },
    {
        "id": "17",
        "catagoryId": "05",
        "name": "Graphic Design Masterclass - Learn GREAT Design",
        "description": "We also learn the basics of Adobe Photoshop, illustrator and InDesign and do projects with real world applications. Every designer needs to know and master these programs and this course makes sure you know the essential tools to power through amazing projects.  In Adobe Photoshop, we will review photo editing and manipulation techniques like how to cut objects out, duotones, changing color on objects, the liquify tool and we will create a compelling YouTube thumbnail with our newly learned photoshop skills as well as an entire book cover design project. ",
        "thumbnail": "https://visme.co/blog/wp-content/uploads/2021/10/what-is-graphic-design-header-1200.png",
        "price": "44.99",
        "students": "174698",
        "rating": "4.7",
        "author": "Lindsay Marsh"
    },
    {
        "id": "18",
        "catagoryId": "05",
        "name": "Canva Master Course | Learn Canva with Ronny",
        "description": "I'm sure you want to learn the latest cool things you can do with Canva right? If you do, you are in the right place my friend! This course will help you get started with Canva (so don’t worry if you are a beginner) and then provide you with a roadmap that will push you to grow into a confident content creator. You will be creating visuals & animated GIFs for social media, you will edit all sorts of videos for TikTok, Instagram or YouTube, you’ll be making your own website and design convincing pitch deck presentations.",
        "thumbnail": "https://static.canva.com/anon_home/og-image-1200x630.jpg",
        "price": "24.99",
        "students": "22673",
        "rating": "4.7",
        "author": "Ronny Hermosa"
    },
    {
        "id": "19",
        "catagoryId": "05",
        "name": "Figma UI UX Design Essentials",
        "description": "First we’ll describe the brief & how to work with a UX persona. Then you’ll learn how to create simple wireframes. From there we’ll look at how to implement colours & images properly in your designs. You’ll learn the do’s & don’ts around choosing fonts for web & mobile apps. You’ll learn how to create your own icons, buttons & other UI components. You’ll learn some pretty scary terms such as Components, Constraints & Multi Dimensional Variants. They are all really easy to understand once you know how. We’ll also make our lives easier by using free UI kits & plugins for Figma which will speed up our workflow dramatically! We’ll build a simple Style Guide ready for client handoff. You’ll understand how to make both simple & advanced micro interactions, page transitions & animations",
        "thumbnail": "https://miro.medium.com/max/1050/1*hp-yfKsmzsj711iLbM8eEw.jpeg",
        "price": "39.99",
        "students": "37698",
        "rating": "4.7",
        "author": "Daniel Walter Scott"
    }
]